ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         bia_application_task.c
* @author       ADI
* @version      V1.0.0
* @date         10-October-2019
* @brief        Source file contains BIA processing wrapper.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/
#ifdef ENABLE_BIA_APP
#include "bia_application_task.h"
#include "sensor_ad5940.h"
#include "app_bia.h"
#include "dcb_interface.h"
#include <includes.h>
#include <string.h>
#include <stdint.h>
#include <limits.h>
#include <ecg_task.h>
#include <adpd4000_dcfg.h>
#include <adi_dcb_config.h>
#include "fds.h"
#include "fds_drv.h"
#include <power_manager.h>
#include "us_tick.h"
#ifdef VSM_MBOARD
#include "watch_vsm_motherboard_pin_config.h"
#elif PCBA
#include "watch_board_pcba_pin_config.h"
#else
#include "watch_board_evt_pin_config.h"
#endif
#include "nrf_drv_gpiote.h"
#include "nrf_log_ctrl.h"

/////////////////////////////////////////
#ifdef DCB
#include <adi_dcb_config.h>
#include <dcb_interface.h>
static volatile bool g_bia_dcb_Present = false;
bool bia_get_dcb_present_flag(void);
void bcm_set_dcb_present_flag(bool set_flag);
BIA_ERROR_CODE_t read_bia_dcb(uint32_t *bia_dcb_data, uint16_t *read_size);
BIA_ERROR_CODE_t write_bia_dcb(uint32_t *bia_dcb_data, uint16_t write_Size);
BIA_ERROR_CODE_t delete_bia_dcb(void);
#endif
/////////////////////////////////////////

/* BCM app Task Module Log settings */
#define NRF_LOG_MODULE_NAME BIA_App_Task

#if BCM_APP_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL BCM_APP_CONFIG_LOG_LEVEL
#endif
#define NRF_LOG_INFO_COLOR  BCM_APP_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR BCM_APP_CONFIG_DEBUG_COLOR
#else /* BCM_TASK_CONFIG_LOG_ENABLED */
#define NRF_LOG_LEVEL       0
#endif /* BCM_TASK_CONFIG_LOG_ENABLED */
#include "nrf_log.h"
/* Enable logger module */
NRF_LOG_MODULE_REGISTER();

extern uint32_t AppBuff[APPBUFF_SIZE];

#ifdef BIA_DCFG_ENABLE

uint8_t bia_load_dcfg=1;
volatile uint8_t bia_user_applied_dcfg = 0;

uint64_t g_current_dcfg_bia[MAX_DEFAULT_DCFG_REGISTER_NUM_BIA];
uint32_t g_user_bia_config_dcfg[MAX_USER_CONFIG_REGISTER_NUM_BIA];
uint8_t g_user_bia_indexes[MAX_USER_CONFIG_REGISTER_NUM_BIA];

uint8_t g_bia_num_ind_settings=0;


// Register numbering used here starts from 0
typedef enum BIA_DCFG_REGISTERS_ENUM_t{

  BIA_SEQUENCER_CONFIG = 4,
  BIA_COMMAND_FIFO_CONFIG = 9,// Command FIFO Mode and Size allowed 
  BIA_FIFO_THRESHOLD_CONFIG = 10,
  BIA_DATA_FIFO_SOURCE_CONFIG = 11,// This Index is saved after reconfiguring FIFO,source of FIFO
  BIA_HIGH_SPEED_RTIA_CONFIG  = 19,
  BIA_WAVEGEN_FREQUENCY_CONFIG = 26, 
  BIA_WAVEGEN_AMPLITUDE_CONFIG = 27,
  BIA_WAVEGEN_OFFSET_CONFIG    = 28, 
  BIA_WAVEGEN_PHASE_CONFIG     = 29,
  BIA_WAVEGEN_CONFIG           = 30,
  BIA_ADC_PGA_GAIN             = 36,
  BIA_ADC_OUTPUT_FILTER_CONFIG = 43,
  BIA_DFT_CONFIG               = 44,
  BIA_DCFG_MAX_CONFIG          = 76,
}BIA_DCFG_REGISTERS_ENUM;

typedef enum BIA_USER_DCFG_REGISTERS_ENUM_t{
  /* list of indexes to be given to user */
  BIA_USER_SEQCFG_REG_COMMAND_SEQUENCER_CONFIG = 0,
  BIA_USER_SEQCFG_REG_COMMAND_FIFO_CONFIG = 1,
  BIA_USER_SEQCFG_REG_FIFO_THRESHOLD_CONFIG = 2,
  BIA_USER_SEQCFG_REG_FIFO_SOURCE_CONFIG = 3,
  BIA_USER_SEQCFG_REG_WAVEGEN_FREQUENCY_CONFIG = 4,
  BIA_USER_SEQCFG_REG_WAVEGEN_AMPLITUDE_CONFIG = 5,
  BIA_USER_SEQCFG_REG_WAVEGEN_OFFSET_CONFIG = 6,
  BIA_USER_SEQCFG_REG_WAVEGEN_PHASE_CONFIG = 7,
  BIA_USER_SEQCFG_REG_WAVEGEN_CONFIG = 8,
  BIA_USER_SEQCFG_REG_ADC_OUTPUT_FILTER_CONFIG = 9,
  BIA_USER_SEQCFG_REG_DFT_CONFIG = 10,
  BIA_MAX_USER_SEQCFG = 11,
}BIA_USER_DCFG_REGISTERS_ENUM;

uint64_t default_dcfg_bia[] = {
    /*Start of Init_1*/
    0x0000200800000000, /* Disabling fifo before changing memory configuration */ 
    0x000021d800000489, /* Command and Data control register setting */
    0x0000200400000000, /* Disable Sequencer */
    0x0000206400000000, /* Clear Sequencer Count and CRC */
    0x0000200400000000, /* Disable sequencer */ 
    0x0000200800004800, /* Restore FIFO configuration */
    0xFFFFFFFFFFFFFFFF,
    /*Start of Init_2*/
    0x0000200800004000, /* Keeping FIFO source DFT and disabling FIFO */ 
    0x0000200800000000, /* Disabling FIFO */
    0x000021d800000489, /* FIFO memory Configuartion */
    0x000021e000040000, /* Setting FIFO Threshold */
    0x0000200800004800, /* Keeping FIFO Source and enabling it */
    0x00003004ffffffff, /* Clearing all Interrupts */
    0xFFFFFFFFFFFFFFFF,
    /*Start of sequencer configuration*/                         
    0x0000200000190e40, /* Enable High Power Referenec Voltage */
    0x0000218000000037, /* Power Buffer Configurations */
    0x0000205000000000, /* Enabling Low power Reference */
    0x000020100000000e, /* High speed DAC configuration */
    0x000020fc00000000, /* High Speed TIA configuration */
    0x000020f000000201, /* High Speed Rtia configuration */
    0x000020f8000000fd, /* DE0 High Speed TIA Resistors Configuration */
    0x0000215000000000, /* D switch matrix configuration */
    0x0000215800006000, /* P switch matrix configuration */
    0x0000215400000c00, /* N switch matrix configuration */
    0x0000215c00000100, /* T switch matrix configuration */
    0x0000200c00010000, /* Switch Matrix configuration */
    0x0000203000333333, /* Waveform Generator, Sinusoid Frequency Control Word */
    0x0000203c000007ff, /* Waveform Generator, Sinusoid Amplitude configuration */
    0x0000203800000000, /* Waveform Generator, Sinusoid Offset */
    0x0000203400000000, /* Waveform Generator, Sinusoid Phase Offset */
    0x0000201400000004, /* Waveform Generator Configuration */
    0x0000212800000001, /* Low Power DAC configuration */
    0x000021200001f68b, /* Low Power DAC output data configuration */
    0x000021240000003e, /* Low Power DAC switch control register */
    0x000020ec00004000, /* Low Power TIA Configuration */
    0x000020e4000033e0, /* Low Power TIA Switch Configuration */
    0x000021a800000101, /* ADC Configuration Register */
    0x000020440000e011, /* ADC Output Filter Configuration */
    0x0000200000190e40, /* AFE Configuration */
    0x000020a800000000, /* ADC Mincheck value */
    0x000020ac00000000, /* ADC Hysterisis value */
    0x000020b000000000, /* ADC Maxvalue check */
    0x000020b400000000, /* ADC Maximum hysterisis value */
    0x000020440000e011, /* ADC Output Filter Configuration */
    0x000020d0001000b1, /* DFT Number ,Hanning Window Configuration*/
    0x000021c400000000, /* Statistics Number Configuration */ 
    0x0000200000194e40, /* AFE Configuration */
    0x0000205400000000, /* GPIO Configuration from Sequencer */
    0xFFFFFFFFFFFFFFFF, /*end of sequencer configuration*/
    /*START OF MEASURE */
    0x0000205400000040, /*  GPIO Configuration from Sequencer */
    0xeeeeeeee00000fa0, /*  static Delay */
    0x0000215000000010, /*  Switch Matrix Full Configuration D */
    0x0000215800000400, /*  P switch matrix configuration */
    0x0000215400000002, /*  N switch matrix configuration */
    0x0000215c00000102, /*  T switch matrix configuration */
    0x0000200c00010000, /*  Switch Matrix configuration */
    0x000021a800000101, /*  ADC Configuration Register */  
    0x0000200000194ec0, /*  AFE Configuration */  
    0xeeeeeeee00000320, /*  static Delay */
    0x000020000019cfc0, /*  AFE Configuration */ 
    0xeeeeeeee0005007d, /*  WaitClks Setting */
    0x0000200000190e40, /*  AFE Configuration */ 
    0x000021a800000607, /*  ADC Configuration Register */ 
    0x0000200000194ec0, /*  AFE Configuration */
    0xeeeeeeee00000320, /*  static Delay */
    0x000020000019cfc0, /*  AFE Configuration */ 
    0xeeeeeeee0005007d, /*  WaitClks Setting */
    0x0000200000190e40, /*  AFE Configuration */ 
    0x0000215000000000, /*  Switch Matrix Full Configuration D */  
    0x0000215800006000, /*  P switch matrix configuration */  
    0x0000215400000c00, /*  N switch matrix configuration */
    0x0000215c00000100, /*  T switch matrix configuration */
    0x0000200c00010000, /*  Switch Matrix configuration */
    0x0000205400000000, /*  GPIO Configuration from Sequencer */
    0x0000211c00000000, /*  Sequencer Trigger Sleep */
    0x0000211c00000001, /*  Sequencer Trigger Sleep */
    0xFFFFFFFFFFFFFFFF, /*  End of Sequencer Measurement */
};
#endif
const char GIT_BIA_VERSION[] = "TEST BIA_VERSION STRING";
const uint8_t GIT_BIA_VERSION_LEN = sizeof(GIT_BIA_VERSION);
static void packetize_bia_raw_data(bia_packetizer_t *p_pktizer);
static void packetize_bcm_algo_data();
static m2m2_hdr_t *bia_app_reg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_app_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_app_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_app_get_version(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_app_decimation(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_app_dft_num_set(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_app_set_cal(m2m2_hdr_t *p_pkt);
static M2M2_SENSOR_BIA_SWEEP_FREQ_INDEX_ENUM_t GetBIASweepFrequencyIndex(float frequency);
#ifdef DEBUG_DCB
static m2m2_hdr_t *adi_dcb_fds_stat(m2m2_hdr_t *p_pkt);
#endif
#ifdef BIA_DCFG_ENABLE
void load_bia_default_dcfg_config(uint64_t *cfg);
static m2m2_hdr_t *bia_app_dcfg_reg_update(m2m2_hdr_t *p_pkt);
#endif
static void fetch_bia_data(void);
static void sensor_bia_task(void *pArgument);
void Enable_ephyz_power(void);
static void InitCfg();
uint32_t ad5940_port_Init(void);
uint32_t ad5940_port_deInit(void);
void ad5940_bia_start(void);
#ifdef DCB
static m2m2_hdr_t *bia_app_set_dcb_lcfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *bia_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif
#ifdef PROFILE_TIME_ENABLED
static m2m2_hdr_t *bcm_app_dcb_timing_info(m2m2_hdr_t *p_pkt) ;
#endif
g_state_bia_t g_state_bia;
volatile bool gBiaAppInitFlag = false;
typedef  m2m2_hdr_t*(app_cb_function_t)(m2m2_hdr_t*);
static _gBiaData_t gBiaData = {{0},0,0,0};
static int32_t BiaSignalData[BIA_BUFFER_SIZE];

volatile uint8_t bia_user_applied_odr = 0;
volatile uint8_t bia_user_applied_dft_num = 0;
static volatile uint8_t user_applied_pga_gain = 0;
static volatile uint8_t user_applied_bia_hsrtia_sel = 0;
static volatile uint8_t user_applied_bia_pwr_mod = 0;
static volatile uint8_t user_applied_sin_freq = 0;
static volatile uint8_t user_applied_algo_decimation_factor = 0;

/*stability bia data*/
#define BIA_DATA_BUFFER_SIZE 20
#define BIA_STABILITY_SAMPLES_COUNT 2
#define BIA_STABILITY_OHMS_DIFF  6
float gbia_data_buffer[BIA_DATA_BUFFER_SIZE];
uint8_t gbia_data_count = 0,gbia_stability_samplecount = 0;
uint8_t gnBiaDataStable = 0;
uint8_t check_bia_data_stability(float body_impedance_real,float body_impedance_imaginary);
void Init_bia_data_stability();

uint8_t sensor_bia_task_stack[APP_OS_CFG_BIA_TASK_STK_SIZE];
ADI_OSAL_THREAD_HANDLE sensor_bia_task_handler;
ADI_OSAL_STATIC_THREAD_ATTR sensor_bia_task_attributes;
StaticTask_t bcmTaskTcb;
ADI_OSAL_SEM_HANDLE   bia_task_evt_sem;
extern uint32_t BiaFifoCount;
extern uint16_t BiaRealImgDataSetCount;
static int32_t bia_counter=0;
extern AD5940_APP_ENUM_t gnAd5940App;

/* first 10 elements are decimal entires in lcfg which does not require IEEE conversion */
#define MAX_DECIMAL_ENTRIES 10

