ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
#ifdef DEBUG_BCM
static uint32_t pkt_count = 0;
static float bcm_odr = 0, time_elapsed_for_bcm = 0, bcm_start_time = 0;
#endif

#ifdef BCM_ALGO
#include <adi_vsm_bcm.h>
#include <adi_bcm_algo.h>

adi_vsm_bcm_instance_t* bcm_instance = NULL;

adi_vsm_bcm_config_t bcm_config_handle={
  /***ADI_algo parameters**/
  .sampling_freq = 20,     /*sampling data rate in Hz*/
  .output_data_rate = 20,     /*Output data rate in Hz*/
  .adi_vsm_bcm_algo_config.height = 160,      /*Height in Cm*/
  .adi_vsm_bcm_algo_config.weight = 60,      /*Weight in Kg*/
  .adi_vsm_bcm_algo_config.age = 30,      /*Age in years*/
  .adi_vsm_bcm_algo_config.b[0] = 0.377285,      /*Zeroth Coeff*/
  .adi_vsm_bcm_algo_config.b[1] = -0.1124,      /*First Coeff*/
  .adi_vsm_bcm_algo_config.b[2] = 0.51977,      /*Second Coeff*/
  .adi_vsm_bcm_algo_config.b[3] = -0.04686,      /*Third Coeff*/
  .adi_vsm_bcm_algo_config.b[4] = 0.000319,      /*Fourth Coeff*/
  .adi_vsm_bcm_algo_config.b[5] = -0.02164,      /*Fifth Coeff*/
  .adi_vsm_bcm_algo_config.b[6] = -0.0001,      /*Sixth Coeff*/
  .adi_vsm_bcm_algo_config.b[7] = -42.9923,      /*Seventh Coeff*/
  };

adi_vsm_bcm_output_t adi_vsm_bcm_output;
uint16_t lcfg_bcm_algo_en=0;
static uint16_t bcm_algo_data_pkt_seq_num;
static uint8_t algo_start_count;
#endif

AppBIACfg_Type AppBIACfg;

/*!
  ****************************************************************************
  *@brief      Initialize configurations for bcm application
  *@param      None
  *@return     None
******************************************************************************/
static void InitCfg()
{
  AppBIACfg.bParaChanged = bTRUE;
  AppBIACfg.SeqStartAddr = 0;
  AppBIACfg.MaxSeqLen = 0;

  AppBIACfg.SeqStartAddrCal = 0;
  AppBIACfg.MaxSeqLenCal = 0;

  /* Application related parameters */
  AppBIACfg.ReDoRtiaCal = bFALSE;
  AppBIACfg.SysClkFreq = 16000000.0;
  AppBIACfg.WuptClkFreq = 32000.0;
  AppBIACfg.AdcClkFreq = 16000000.0;
  AppBIACfg.NumOfData = -1;
  AppBIACfg.RcalVal = 10000.0; /* 10kOhm */

  
  if(!user_applied_bia_pwr_mod) {
    AppBIACfg.PwrMod = AFEPWR_LP;
  } else {
    user_applied_bia_pwr_mod = 0;
  }
#ifndef BIA_DCFG_ENABLE
  if(!user_applied_bia_hsrtia_sel) {
    AppBIACfg.HstiaRtiaSel = HSTIARTIA_1K;
  } else {
    user_applied_bia_hsrtia_sel = 0;
  }
#endif
  AppBIACfg.CtiaSel = 16;
  AppBIACfg.ExcitBufGain = EXCITBUFGAIN_2;
  AppBIACfg.HsDacGain = HSDACGAIN_1;
  AppBIACfg.HsDacUpdateRate = 7;
  AppBIACfg.DacVoltPP = 800.0;

#ifndef BIA_DCFG_ENABLE
  if(!user_applied_sin_freq) {
   AppBIACfg.SinFreq = 50000.0; /* 50kHz */
  } else {
    user_applied_sin_freq = 0;
  }
  if(!user_applied_pga_gain) {
    AppBIACfg.ADCPgaGain = ADCPGA_1;
  } else {
    user_applied_pga_gain = 0;
  }
#endif

  AppBIACfg.ADCSinc3Osr = ADCSINC3OSR_2;
  AppBIACfg.ADCSinc2Osr = ADCSINC2OSR_22;
#ifndef BIA_DCFG_ENABLE
  AppBIACfg.DftNum = DFTNUM_8192;
#endif
  AppBIACfg.DftSrc = DFTSRC_SINC3;
  AppBIACfg.HanWinEn = bTRUE;

  /* private variables */
  AppBIACfg.SweepCfg.SweepEn = bFALSE;
  AppBIACfg.SweepCfg.SweepStart = 10000;
  AppBIACfg.SweepCfg.SweepStop = 150000.0;
  AppBIACfg.SweepCfg.SweepPoints = 100;
  AppBIACfg.SweepCfg.SweepLog = bTRUE;
  AppBIACfg.SweepCfg.SweepIndex = 0;

  AppBIACfg.FifoThresh = 4;
  AppBIACfg.BIAInited = bFALSE;
  AppBIACfg.StopRequired = bFALSE;
  AppBIACfg.bRunning = bFALSE;
  AppBIACfg.MeasSeqCycleCount = 0;
}


/*!
 * @brief:  The dictionary type for mapping addresses to callback handlers.
 */
typedef struct _app_routing_table_entry_t {
  uint8_t                    command;
  app_cb_function_t          *cb_handler;
}app_routing_table_entry_t;

app_routing_table_entry_t bia_app_routing_table[] = {
  {M2M2_APP_COMMON_CMD_STREAM_START_REQ, bia_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, bia_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, bia_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, bia_app_stream_config},
  {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, bia_app_status},
  {M2M2_APP_COMMON_CMD_READ_LCFG_REQ, bia_app_reg_access},
  {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, bia_app_reg_access},
  {M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ, bia_app_decimation},
  {M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ, bia_app_decimation},
  {M2M2_APP_COMMON_CMD_GET_VERSION_REQ, bia_app_get_version},
  {M2M2_BIA_APP_CMD_SET_DFT_NUM_REQ, bia_app_dft_num_set},
  {M2M2_BIA_APP_CMD_SET_HS_RTIA_CAL_REQ, bia_app_set_cal},
#ifdef BIA_DCFG_ENABLE    
  {M2M2_BIA_APP_CMD_LOAD_DCFG_REQ, bia_app_stream_config},
  {M2M2_BIA_APP_COMMON_CMD_WRITE_DCFG_REQ, bia_app_dcfg_reg_update},
  {M2M2_BIA_APP_COMMON_CMD_READ_DCFG_REQ, bia_app_dcfg_reg_update},
#endif  
#ifdef DEBUG_DCB
  {M2M2_DCB_COMMAND_FDS_STATUS_REQ, adi_dcb_fds_stat},
#endif
#ifdef PROFILE_TIME_ENABLED
  {M2M2_APP_COMMON_CMD_DCB_TIMING_INFO_REQ, bcm_app_dcb_timing_info},
#endif
#ifdef DCB
    {M2M2_APP_COMMON_CMD_SET_LCFG_REQ, bia_app_set_dcb_lcfg},
    {M2M2_DCB_COMMAND_READ_CONFIG_REQ, bia_dcb_command_read_config},
    {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, bia_dcb_command_write_config},
    {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, bia_dcb_command_delete_config},
#endif
};

#define BIA_APP_ROUTING_TBL_SZ (sizeof(bia_app_routing_table) / sizeof(bia_app_routing_table[0]))

ADI_OSAL_QUEUE_HANDLE  bia_task_msg_queue = NULL;

/*!
  ****************************************************************************
  *@brief       BCM Task initialization
  *@param       None
  *@return      None
******************************************************************************/
void ad5940_bia_task_init(void) {
  /* Initialize app state */
  g_state_bia.num_subs = 0;
  g_state_bia.num_starts = 0;
  /* Default behaviour is to send every packet */
  g_state_bia.decimation_factor = 1;
  g_state_bia.decimation_nsamples = 0;
  g_state_bia.data_pkt_seq_num = 0;
#ifdef BCM_ALGO
  bcm_algo_data_pkt_seq_num = 0;
  algo_start_count = 0;
#endif
  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  sensor_bia_task_attributes.pThreadFunc = sensor_bia_task;
  sensor_bia_task_attributes.nPriority = APP_OS_CFG_BIA_TASK_PRIO;
  sensor_bia_task_attributes.pStackBase = &sensor_bia_task_stack[0];
  sensor_bia_task_attributes.nStackSize = APP_OS_CFG_BIA_TASK_STK_SIZE;
  sensor_bia_task_attributes.pTaskAttrParam = NULL;
  sensor_bia_task_attributes.szThreadName = "BIA Sensor";
  sensor_bia_task_attributes.pThreadTcb = &bcmTaskTcb;

  eOsStatus = adi_osal_MsgQueueCreate(&bia_task_msg_queue,NULL,5);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_BCM_TASK_INDEX,bia_task_msg_queue);
  }
  eOsStatus = adi_osal_ThreadCreateStatic(&sensor_bia_task_handler,
                                          &sensor_bia_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

