ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
  adi_osal_SemCreate(&bia_task_evt_sem, 0);
}

/*!
  ****************************************************************************
  *@brief      Called by the post office to send messages to this application
  *@param      p_pkt: packet of type m2m2_hdr_t
  *@return     None
******************************************************************************/
void send_message_ad5940_bia_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(bia_task_msg_queue,p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(bia_task_evt_sem);
}

/*!
  ****************************************************************************
  *@brief      BCM Task
  *@param      None
  *@return     None
******************************************************************************/
static void sensor_bia_task(void *pArgument) {
  ADI_OSAL_STATUS         err;

  /*Wait for FDS init to complete*/
  adi_osal_SemPend(bia_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

  post_office_add_mailbox(M2M2_ADDR_MED_BIA, M2M2_ADDR_MED_BIA_STREAM);
  post_office_add_mailbox(M2M2_ADDR_MED_BIA, M2M2_ADDR_BCM_ALGO_STREAM);
  while (1) {
    m2m2_hdr_t *p_in_pkt = NULL;
    m2m2_hdr_t *p_out_pkt = NULL;
    adi_osal_SemPend(bia_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_BCM_TASK_INDEX);
    if (p_in_pkt == NULL) {
      /* No m2m2 messages to process, so fetch some data from the device. */
      if(g_state_bia.num_starts != 0) /* Fetch data from device only if the device is in active state(initialized properly)*/
        fetch_bia_data();
    } else {
      /* Got an m2m2 message from the queue, process it. */
     PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
     /* Look up the appropriate function to call in the function table */
      for (int i = 0; i < BIA_APP_ROUTING_TBL_SZ; i++) {
        if (bia_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = bia_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    }
  }
}

/*!
  ****************************************************************************
  *@brief      Reset BCM packet counter
  *@param      None
  *@return     None
******************************************************************************/
static void reset_bia_packetization(void) {
   g_state_bia.bia_pktizer.packet_nsamples = 0;
}


/*!
  ****************************************************************************
  *@brief      Fetch BCM data
  *@param      None
  *@return     None
******************************************************************************/
static void fetch_bia_data(void){
  ADI_OSAL_STATUS         err;
  uint32_t bcmData[2] = {0};
  uint32_t bcmTS = 0;
  int8_t status = 0;
  M2M2_SENSOR_BIA_APP_INFO_BITSET_ENUM_t leadsOn = M2M2_SENSOR_BIA_APP_INFO_BITSET_LEADSOFF;
  fImpCar_Type *pImp;
  ad5940_read_bia_data_to_buffer();
  status = ad5940_buff_get(&bcmData[0], &bcmTS);
  bia_counter = 0;
  while(status == AD5940Drv_SUCCESS) {
   /* reading a pair of samples for impedance calculation */
    BiaSignalData[bia_counter++] = bcmData[0];
    BiaSignalData[bia_counter++] = bcmData[1];
    pImp = (fImpCar_Type*)&BiaSignalData; // convert two 32 bits value pairs to real and imaginary
    gBiaData.biaImpedence.real = pImp->Real;
    gBiaData.biaImpedence.img = pImp->Image;
    gBiaData.biaImpedence.timestamp = bcmTS;
    g_state_bia.decimation_nsamples++;
    if (g_state_bia.decimation_nsamples >= g_state_bia.decimation_factor) {
      g_state_bia.decimation_nsamples = 0;
      packetize_bia_raw_data(&g_state_bia.bia_pktizer);
      leadsOn = check_bia_data_stability(gBiaData.biaImpedence.real, gBiaData.biaImpedence.img);
      if (g_state_bia.bia_pktizer.packet_nsamples >= g_state_bia.bia_pktizer.packet_max_nsamples) {
        adi_osal_EnterCriticalRegion();
        PYLD_CST(g_state_bia.bia_pktizer.p_pkt,bia_app_stream_t, p_payload_ptr);
        p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
        p_payload_ptr->status = 0x00;
        p_payload_ptr->datatype = M2M2_SENSOR_BIA_DATA;
        p_payload_ptr->bia_info = leadsOn;
        g_state_bia.bia_pktizer.p_pkt->src = M2M2_ADDR_MED_BIA;
        g_state_bia.bia_pktizer.p_pkt->dest = M2M2_ADDR_MED_BIA_STREAM;
        p_payload_ptr->sequence_num = g_state_bia.data_pkt_seq_num++;
#ifdef DEBUG_PKT
        post_office_msg_cnt(g_state_bia.bia_pktizer.p_pkt);
#endif
#ifdef DEBUG_BCM
        pkt_count++;
        time_elapsed_for_bcm =  MCU_HAL_GetTick() - bcm_start_time;
        bcm_odr = ((pkt_count*4*1000)/time_elapsed_for_bcm);
        NRF_LOG_INFO("TIME ELAPSED = "NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(time_elapsed_for_bcm));
        NRF_LOG_INFO("START TIME = "NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(bcm_start_time));
        NRF_LOG_INFO("BCM MEASURED ODR = "NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(bcm_odr));
#endif
        post_office_send(g_state_bia.bia_pktizer.p_pkt, &err);
        adi_osal_ExitCriticalRegion();
        g_state_bia.bia_pktizer.packet_nsamples = 0;
        g_state_bia.bia_pktizer.packet_max_nsamples = 0;
        g_state_bia.bia_pktizer.p_pkt = NULL;
      }
    }
#ifdef BCM_ALGO
   /* packetize algo data */
    if(leadsOn == 1)  {
      // if (g_state_bia.decimation_nsamples >= g_state_bia.algo_decimation_factor) {
      //  g_state_bia.decimation_nsamples = 0;
        packetize_bcm_algo_data();
     // }
    }
#endif
   /* Copy data from circular buffer data to soft buffer*/
    status = ad5940_buff_get(&bcmData[0], &bcmTS);
    bia_counter = 0;
  }
}

/*!
  ****************************************************************************
  *@brief      Packetize bcm data
  *@param      pSignalData: pointer to the bcm data
  *@param      pPkt: pointer to the packet structure
  *@param      timestamp: timestamp of the packet
  *@return     None
******************************************************************************/
static void packetize_bia_raw_data(bia_packetizer_t *p_pktizer) {
     M2M2_SENSOR_BIA_SWEEP_FREQ_INDEX_ENUM_t nfrequency_index = GetBIASweepFrequencyIndex(AppBIACfg.SinFreq);
    /*Calculate Impedance in form of Cartesian form */
    if (p_pktizer->packet_nsamples == 0) {
      p_pktizer->p_pkt = post_office_create_msg(sizeof(bia_app_stream_t) + M2M2_HEADER_SZ);
      PYLD_CST(p_pktizer->p_pkt, bia_app_stream_t, p_payload_ptr);
      g_state_bia.bia_pktizer.packet_max_nsamples=(sizeof(p_payload_ptr->bia_data)/sizeof(p_payload_ptr->bia_data[0]));
      p_payload_ptr->bia_data[0].timestamp = gBiaData.biaImpedence.timestamp;
      /* multiply data by 1000 to save the float precision*/
      p_payload_ptr->bia_data[0].real = (int32_t)(gBiaData.biaImpedence.real * 1000);
      p_payload_ptr->bia_data[0].img = (int32_t)(gBiaData.biaImpedence.img * 1000);
      p_payload_ptr->bia_data[0].freq_index = nfrequency_index;
      p_pktizer->packet_nsamples++;
    } else if (p_pktizer->packet_nsamples < p_pktizer->packet_max_nsamples) {
      PYLD_CST(p_pktizer->p_pkt, bia_app_stream_t, p_payload_ptr);
      /*  one packet =  four samples
      first sample was added with above check
      and remaining 3 samples are added here */
      uint16_t i = p_pktizer->packet_nsamples;
      p_payload_ptr->bia_data[i].timestamp =  gBiaData.biaImpedence.timestamp;
       /* multiply data by 1000 to save the float precision*/
      p_payload_ptr->bia_data[i].real = (int32_t)(gBiaData.biaImpedence.real * 1000);
      p_payload_ptr->bia_data[i].img = (int32_t)(gBiaData.biaImpedence.img * 1000);
      p_payload_ptr->bia_data[i].freq_index = nfrequency_index;
      p_pktizer->packet_nsamples++;
    }
}

