ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
#ifdef BCM_ALGO
/*!
  ****************************************************************************
  *@brief      Packetize bcm algo data
  *@param      pBiaData: Pointer to BIA
  *@return     None
******************************************************************************/
static void packetize_bcm_algo_data() {
  ADI_OSAL_STATUS         err;
  BCM_ALG_RETURN_CODE_t ret = BCM_ALG_ERROR;
    /* Estimate Fat Free Mass ( FFM ) */
    /* if bia is running */
  if(algo_start_count == 1) {
    /* if algorithm is enabled */
    if(lcfg_bcm_algo_en) {
      float bodyImpedance[2]={0};
      bodyImpedance[0] = gBiaData.biaImpedence.real;
      bodyImpedance[1] = gBiaData.biaImpedence.img;
      ret = BcmAlgProcess(bcm_instance,bodyImpedance,
                      &adi_vsm_bcm_output);
      /* bcm algo process */
      if(ret != ADI_VSM_BCM_IN_PROGRESS) {
        adi_osal_EnterCriticalRegion();
        /* packetize stream */
        m2m2_hdr_t *p_pkt = post_office_create_msg(sizeof(bcm_app_algo_out_stream_t) + M2M2_HEADER_SZ);
        if(p_pkt != NULL){
          PYLD_CST(p_pkt, bcm_app_algo_out_stream_t, p_payload_ptr);
          p_payload_ptr->sequence_num = bcm_algo_data_pkt_seq_num++;
          p_payload_ptr->status = M2M2_APP_COMMON_STATUS_OK;
          if(ret == BCM_ALG_SUCCESS) {
            p_payload_ptr->ffm_estimated = adi_vsm_bcm_output.ffm_estimated;
            p_payload_ptr->bmi = adi_vsm_bcm_output.bmi;
            p_payload_ptr->fat_percent = adi_vsm_bcm_output.fatpercent;
          }else if(ret == BCM_ALG_NULL_PTR_ERROR || ret == BCM_ALG_ERROR) {
            p_payload_ptr->ffm_estimated = 0xFF;
            p_payload_ptr->bmi = 0xFF;
            p_payload_ptr->fat_percent = 0xFF;
          }
          p_payload_ptr->time_stamp = get_sensor_time_stamp();
          p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
          p_pkt->src = M2M2_ADDR_MED_BIA;
          p_pkt->dest = M2M2_ADDR_BCM_ALGO_STREAM;
          post_office_send(p_pkt, &err);
        }
        adi_osal_ExitCriticalRegion();
      }else {
        // skip packetization during decimation 
        adi_vsm_bcm_output.ffm_estimated = 0;
        adi_vsm_bcm_output.bmi = 0;
        adi_vsm_bcm_output.fatpercent = 0;
      }
    }
  }
}

#endif
/*!
  ****************************************************************************
  *@brief      Set BCM DFT number
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bia_app_dft_num_set(m2m2_hdr_t *p_pkt) {
   /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, bia_app_set_dft_num_t, p_in_payload);

  /* Allocate memory to the response packet payload */
  PKT_MALLOC(p_resp_pkt, bia_app_set_dft_num_t, 0);
  if (NULL != p_resp_pkt) {
  	/* Declare a pointer to the response packet payload */
  	PYLD_CST(p_resp_pkt, bia_app_set_dft_num_t, p_resp_payload);

  	/* Copy dft number from payload if valid setting  */
  	if(p_in_payload->dftnum <= 12) {
   	NRF_LOG_INFO("Valid dft num sel");
    	AppBIACfg.DftNum = p_in_payload->dftnum;
    	bia_user_applied_dft_num = 1;
  } else {
    /* default DFT number value */
    AppBIACfg.DftNum = DFTNUM_8192;
  }

  	p_resp_payload->command = M2M2_BIA_APP_CMD_SET_DFT_NUM_RESP;
 	p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
  	p_resp_payload->dftnum = p_in_payload->dftnum;
  	p_resp_pkt->src = p_pkt->dest;
  	p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
  ****************************************************************************
  *@brief      Get BCM application version
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bia_app_get_version(m2m2_hdr_t *p_pkt) {
  /*  Allocate memory to response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_version_t, 0);
  if (NULL != p_resp_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, m2m2_app_common_version_t, p_resp_payload);

  p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
  p_resp_payload->major = 0x03;
  p_resp_payload->minor = 0x04;
  p_resp_payload->patch = 0x03;
  memcpy(&p_resp_payload->verstr[0], "BCM_App",  8);
  memcpy(&p_resp_payload->str[0], &GIT_BIA_VERSION, GIT_BIA_VERSION_LEN);
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
  ****************************************************************************
  *@brief      Get BCM application status
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bia_app_status(m2m2_hdr_t *p_pkt) {
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if (NULL != p_resp_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

  p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
  p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

  if (g_state_bia.num_starts == 0) {
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
  } else {
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
  }
  p_resp_payload->stream = M2M2_ADDR_MED_BIA_STREAM;
  p_resp_payload->num_subscribers = g_state_bia.num_subs;
  p_resp_payload->num_start_reqs = g_state_bia.num_starts;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}



#ifdef PROFILE_TIME_ENABLED
extern uint16_t update_entry;
extern uint16_t read_entry;
extern uint16_t del_rec;
extern uint16_t check_rec;
extern uint16_t clear_entries;

/*!
  ****************************************************************************
  *@brief      Get BCM application timing information
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bcm_app_dcb_timing_info(m2m2_hdr_t *p_pkt) {
   /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_dcb_fds_timing_info_req_t, p_in_payload);

  /* Allocate memory for response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_fds_timing_info_resp_t, 0);
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, m2m2_dcb_fds_timing_info_resp_t, p_resp_payload);

  p_resp_payload->command = M2M2_APP_COMMON_CMD_DCB_TIMING_INFO_RESP;
  p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
  p_resp_payload->adi_dcb_clear_entries_time = clear_entries;
  p_resp_payload->adi_dcb_check_entries_time = check_rec;
  p_resp_payload->adi_dcb_delete_record_time = del_rec;
  p_resp_payload->adi_dcb_read_entry_time = read_entry;
  p_resp_payload->adi_dcb_update_entry_time =  update_entry;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  return p_resp_pkt;
}
#endif

/*!
  ****************************************************************************
  *@brief      Set high power loop calibration resitance
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bia_app_set_cal(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, bia_app_hs_rtia_sel_t, p_in_payload);

  /* Allocate memory for response payload */
  PKT_MALLOC(p_resp_pkt, bia_app_hs_rtia_sel_t, 0);
  if (NULL != p_resp_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, bia_app_hs_rtia_sel_t, p_resp_payload);
  p_resp_payload->command = M2M2_BIA_APP_CMD_SET_HS_RTIA_CAL_RESP;
  p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;

