ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
  /* HS rtia selection  */
  AppBIACfg.HstiaRtiaSel = p_in_payload->hsritasel;
  NRF_LOG_INFO("HsRtiaSel=%d",AppBIACfg.HstiaRtiaSel);
  p_resp_payload->hsritasel = AppBIACfg.HstiaRtiaSel;
  user_applied_bia_hsrtia_sel = 1;

  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
  ****************************************************************************
  *@brief      Set bcm stream configuration
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bia_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t    command;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

  switch (p_in_payload->command) {
  case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
      /*  BCM variable app */
      gnAd5940App = AD5940_APP_BIA;
      reset_bia_packetization();
     if (g_state_bia.num_starts == 0) {
      if (BiaAppInit() == BIA_SUCCESS) {
        g_state_bia.num_starts = 1;
        /*bia data stability initialize*/
        Init_bia_data_stability();
#ifdef BCM_ALGO
        if(lcfg_bcm_algo_en && (algo_start_count == 0))  {
          bcm_config_handle.sampling_freq = AppBIACfg.BiaODR;
          if(bcm_algo_init() ==  BCM_ALG_SUCCESS) {
            algo_start_count = 1;
            status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
          }else {            
            algo_start_count = 0;
            status = M2M2_APP_COMMON_STATUS_ERROR;
          }
        }
#endif
          status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
#ifdef DEBUG_BCM
        bcm_start_time = MCU_HAL_GetTick();
        pkt_count = 0;
#endif
      } else {
        status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
      }
    } else {
      g_state_bia.num_starts++;
      status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
    if (g_state_bia.num_starts == 0) {
      status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else if (g_state_bia.num_starts == 1) {
      if (BiaAppDeInit()) {
        g_state_bia.num_starts = 0;
#ifdef BCM_ALGO
        if(lcfg_bcm_algo_en && (algo_start_count == 1)){
         if(BcmAlgReset(bcm_instance) ==  BCM_ALG_SUCCESS) {
           status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
           algo_start_count = 0;
         }else{
           status = M2M2_APP_COMMON_STATUS_ERROR;
         }
        }else{
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
        }
#else
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
#endif
      } else {
        g_state_bia.num_starts = 1;
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    } else {
      g_state_bia.num_starts--;
      status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
    g_state_bia.num_subs++;
    if(g_state_bia.num_subs == 1)
    {
       /* reset pkt sequence no. only during 1st sub request */
       g_state_bia.data_pkt_seq_num = 0;
#ifdef BCM_ALGO
       bcm_algo_data_pkt_seq_num = 0;
#endif
    }
    post_office_setup_subscriber(M2M2_ADDR_MED_BIA, M2M2_ADDR_MED_BIA_STREAM, p_pkt->src, true);
    post_office_setup_subscriber(M2M2_ADDR_MED_BIA, M2M2_ADDR_BCM_ALGO_STREAM, p_pkt->src, true);
    status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
    command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
    if (g_state_bia.num_subs <= 1) {
      g_state_bia.num_subs = 0;
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
    } else {
      g_state_bia.num_subs--;
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
    }
    post_office_setup_subscriber(M2M2_ADDR_MED_BIA, M2M2_ADDR_MED_BIA_STREAM, p_pkt->src, false);
    post_office_setup_subscriber(M2M2_ADDR_MED_BIA, M2M2_ADDR_BCM_ALGO_STREAM, p_pkt->src, false);
    command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
    break;

#ifdef BIA_DCFG_ENABLE
  case M2M2_BIA_APP_CMD_LOAD_DCFG_REQ:

    if (!g_state_bia.num_starts) {
        user_applied_bia_hsrtia_sel = 0;
        user_applied_sin_freq = 0;
        user_applied_pga_gain = 0;
        bia_user_applied_dft_num = 0;
        load_bia_default_dcfg_config(&default_dcfg_bia[0]);
        status = M2M2_APP_COMMON_STATUS_OK;
      } else {
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    /* clear flag to not load global array again if its loaded from load req*/
    bia_load_dcfg = 0;
    command = M2M2_BIA_APP_CMD_LOAD_DCFG_RESP;
    break;
#endif
  default:
    /* Something has gone horribly wrong. */
    post_office_consume_msg(p_resp_pkt);
    return NULL;
  }
  p_resp_payload->command = command;
  p_resp_payload->status = status;
  p_resp_payload->stream = p_in_payload->stream;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  return p_resp_pkt;
}

/*!
  ****************************************************************************
  *@brief      Bcm stream register access
  *@param      pPkt: pointer to the packet structure
  *@return     m2m2_hdr_t
******************************************************************************/
static m2m2_hdr_t *bia_app_reg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, bia_app_lcfg_op_hdr_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations */
  PKT_MALLOC(p_resp_pkt, bia_app_lcfg_op_hdr_t, p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
  PYLD_CST(p_resp_pkt, bia_app_lcfg_op_hdr_t, p_resp_payload);
  float  reg_data = 0;

