ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
  switch (p_in_payload->command) {
  case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
    for (int i = 0; i < p_in_payload->num_ops; i++) {
      if (BiaReadLCFG(p_in_payload->ops[i].field, &reg_data) == BIA_SUCCESS) {
        status = M2M2_APP_COMMON_STATUS_OK;
      } else {
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
      p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
      p_resp_payload->ops[i].value = reg_data;
    }
    p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
    break;
  case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
    for (int i = 0; i < p_in_payload->num_ops; i++) {
      if (BiaWriteLCFG(p_in_payload->ops[i].field, p_in_payload->ops[i].value) == BIA_SUCCESS) {
        status = M2M2_APP_COMMON_STATUS_OK;
      } else {
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
      p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
      p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
    }
    p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
    break;
  default:
    /* Something has gone horribly wrong. */
    post_office_consume_msg(p_resp_pkt);
    return NULL;
  }
  p_resp_pkt->dest = p_pkt->src;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_payload->num_ops = p_in_payload->num_ops;
  p_resp_payload->status = status;
  }
  return p_resp_pkt;
}


/*!
  ****************************************************************************
 * @brief  Bcm App decimation
 * @param  None
 * @return ECG_ERROR_CODE_t: Success/Error
 *****************************************************************************/
static m2m2_hdr_t *bia_app_decimation(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_OK;

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_common_decimate_stream_t, p_in_payload);

  /* Allocate a response packet with space for the correct number of operations */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_decimate_stream_t, 0);
  if (NULL != p_resp_pkt) {
  PYLD_CST(p_resp_pkt, m2m2_sensor_common_decimate_stream_t, p_resp_payload);

  switch (p_in_payload->command) {
  case M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ:
    p_resp_payload->command = M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_RESP;
    break;
  case M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ:
    g_state_bia.decimation_factor = p_in_payload->dec_factor;
    if (g_state_bia.decimation_factor == 0) {
      g_state_bia.decimation_factor = 1;
    }
    p_resp_payload->command = M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_RESP;
    break;
  }
    p_resp_payload->status = status;
    p_resp_payload->dec_factor = g_state_bia.decimation_factor;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
  }
  return p_resp_pkt;
}

#ifdef BIA_DCFG_ENABLE


/**
      @brief    Map user Index 
      @param    User Index
      @retval   DCFG Array Index
*/
uint8_t bia_mapuserind(uint8_t *userind)  {
  uint8_t array_ind=0;
    switch(*userind)  {
     case BIA_USER_SEQCFG_REG_COMMAND_SEQUENCER_CONFIG:
      array_ind = BIA_SEQUENCER_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_COMMAND_FIFO_CONFIG:
      array_ind = BIA_COMMAND_FIFO_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_FIFO_THRESHOLD_CONFIG:
      array_ind = BIA_FIFO_THRESHOLD_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_FIFO_SOURCE_CONFIG:
      array_ind = BIA_DATA_FIFO_SOURCE_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_WAVEGEN_FREQUENCY_CONFIG:
      array_ind = BIA_WAVEGEN_FREQUENCY_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_WAVEGEN_AMPLITUDE_CONFIG:
      array_ind = BIA_WAVEGEN_AMPLITUDE_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_WAVEGEN_OFFSET_CONFIG:
      array_ind = BIA_WAVEGEN_OFFSET_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_WAVEGEN_PHASE_CONFIG:
      array_ind = BIA_WAVEGEN_PHASE_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_WAVEGEN_CONFIG:
      array_ind = BIA_WAVEGEN_CONFIG;
      break; 
     case BIA_USER_SEQCFG_REG_ADC_OUTPUT_FILTER_CONFIG:
      array_ind = BIA_ADC_OUTPUT_FILTER_CONFIG;
      break;
     case BIA_USER_SEQCFG_REG_DFT_CONFIG:
      array_ind = BIA_DFT_CONFIG;
      break;
     default:
      array_ind = BIA_DCFG_MAX_CONFIG;
      break;
    }
    return array_ind;
}

/**
      @brief    Map Adress to User Index 
      @param    Register Address
      @retval   User Array Index
*/
static uint8_t bia_mapaddrind(uint32_t *address)  {
  uint8_t user_ind=0;
    switch(*address)  {
     case BIA_SEQUENCER_CONFIGURATION_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_COMMAND_SEQUENCER_CONFIG;
      break;
     case BIA_FIFO_THRESHOLD_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_FIFO_THRESHOLD_CONFIG;
      break;
     case BIA_FIFO_CONFIGURATION_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_COMMAND_FIFO_CONFIG;
      break;
     case BIA_FIFO_SRC_CONFIGURATION_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_FIFO_SOURCE_CONFIG;
      break;
     case BIA_WAVEFORM_GENERATOR_FREQUENCY_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_WAVEGEN_FREQUENCY_CONFIG;
      break;
     case BIA_WAVEFORM_GENERATOR_AMPLITUDE_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_WAVEGEN_AMPLITUDE_CONFIG;
      break;
     case BIA_WAVEFORM_GENERATOR_OFFSET_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_WAVEGEN_OFFSET_CONFIG;
      break;
     case BIA_WAVEFORM_GENERATOR_PHASE_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_WAVEGEN_PHASE_CONFIG;
      break;
     case BIA_WAVEFORM_GENERATOR_CONFIGURATION_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_WAVEGEN_CONFIG;
      break;
     case BIA_ADC_OUTPUT_FILTER_CONFIGURATION_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_ADC_OUTPUT_FILTER_CONFIG;
      break;
     case BIA_DFT_CONFIGURATION_REGISTER:
      user_ind = BIA_USER_SEQCFG_REG_DFT_CONFIG;
      break;
     default:
       user_ind = BIA_MAX_USER_SEQCFG;
      break;
    }
    return user_ind;
}

/*!
 ****************************************************************************
 *@brief      BIA Dcfg read/write
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *bia_app_dcfg_reg_update(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, bia_app_dcfg_op_hdr_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, bia_app_dcfg_op_hdr_t,p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, bia_app_dcfg_op_hdr_t, p_resp_payload);

