ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
    switch (p_in_payload->command) {
     static uint8_t dcfg_position=0;
     static uint8_t array_ind=0;
    case M2M2_BIA_APP_COMMON_CMD_WRITE_DCFG_REQ:
      /* Copy register addresses, value pairs */
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        uint32_t addr = (uint32_t)p_in_payload->ops[i].field;
        /* Map Address of register to user index */
        dcfg_position = bia_mapaddrind(&addr);
        if(dcfg_position < BIA_MAX_USER_SEQCFG){
          g_user_bia_config_dcfg[dcfg_position] = p_in_payload->ops[i].value;
          g_user_bia_indexes[i] = dcfg_position;
          status = M2M2_APP_COMMON_STATUS_OK;
        }else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        /* number of user settings */
        g_bia_num_ind_settings = p_in_payload->num_ops;
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      /* Update write flag */
      bia_user_applied_dcfg = 1;
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t) M2M2_BIA_APP_COMMON_CMD_WRITE_DCFG_RESP;
     break;
    case M2M2_BIA_APP_COMMON_CMD_READ_DCFG_REQ:
      /* Copy register addresses, value pairs */
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        uint32_t addr = (uint32_t)p_in_payload->ops[i].field; 
        dcfg_position = bia_mapaddrind(&addr);
        /* find index to set */
        array_ind = bia_mapuserind(&dcfg_position);
        if(array_ind < BIA_DCFG_MAX_CONFIG) {
          status = M2M2_APP_COMMON_STATUS_OK;
        }
        else  {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
       p_resp_payload->ops[i].value = g_current_dcfg_bia[array_ind];
      }
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t) M2M2_BIA_APP_COMMON_CMD_READ_DCFG_RESP;
     break;
    default:
      /* Something has gone horribly wrong. */
      post_office_consume_msg(p_resp_pkt);
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}
/**
      @brief    Load bia  lcfg configuration to working dcfg array
      @param    None
      @retval   None
*/
void bia_load_lcfg_params(void){

  /* This Function is called after Initcfg so other parameters already initialized */
  if(user_applied_bia_hsrtia_sel) {
    g_current_dcfg_bia[BIA_HIGH_SPEED_RTIA_CONFIG] &= ~(BITM_AFE_HSRTIACON_RTIACON);
    g_current_dcfg_bia[BIA_HIGH_SPEED_RTIA_CONFIG] |= ((AppBIACfg.HstiaRtiaSel << BITP_AFE_HSRTIACON_RTIACON ) & (BITM_AFE_HSRTIACON_RTIACON));
    user_applied_bia_hsrtia_sel = 0;
  } else {
    AppBIACfg.HstiaRtiaSel = (uint32_t) ( g_current_dcfg_bia[BIA_HIGH_SPEED_RTIA_CONFIG] & BITM_AFE_HSRTIACON_RTIACON);
    AppBIACfg.HstiaRtiaSel >>= BITP_AFE_HSRTIACON_RTIACON; 
  }

  if(user_applied_sin_freq) {

    /*  Frequency of data need to be enabled once sweep feature is brought in */
    //AppBIACfg.FreqofData = AppBIACfg.SinFreq;
    g_current_dcfg_bia[BIA_WAVEGEN_FREQUENCY_CONFIG] &= ~(BIA_WG_SINE_FREQUENCY_WORD_MASK);
    g_current_dcfg_bia[BIA_WAVEGEN_FREQUENCY_CONFIG] |= AD5940_WGFreqWordCal(AppBIACfg.SinFreq, AppBIACfg.SysClkFreq);
    user_applied_sin_freq = 0;
  } else {
    /* Recalculate sine frequency from frequency word register and system clock */
      float temp_sinfreqword = (float)( g_current_dcfg_bia[BIA_WAVEGEN_FREQUENCY_CONFIG] & BIA_WG_SINE_FREQUENCY_WORD_MASK);
      temp_sinfreqword /= (1LL<<30); 
      AppBIACfg.SinFreq = (float)( AppBIACfg.SysClkFreq * temp_sinfreqword);
  }
  
  if(user_applied_pga_gain) {
    g_current_dcfg_bia[BIA_ADC_PGA_GAIN] &= ~(BITM_AFE_ADCCON_GNPGA);
    g_current_dcfg_bia[BIA_ADC_PGA_GAIN] |= ((AppBIACfg.ADCPgaGain << BITP_AFE_ADCCON_GNPGA ) & (BITM_AFE_ADCCON_GNPGA));
    user_applied_pga_gain = 0;    
  } else {
    AppBIACfg.ADCPgaGain = (uint32_t) ( g_current_dcfg_bia[BIA_ADC_PGA_GAIN] & BITM_AFE_ADCCON_GNPGA);
    AppBIACfg.ADCPgaGain >>= BITP_AFE_ADCCON_GNPGA;
  }

  if(bia_user_applied_dft_num){
    g_current_dcfg_bia[BIA_DFT_CONFIG] &= ~(BITM_AFE_DFTCON_DFTNUM);
    g_current_dcfg_bia[BIA_DFT_CONFIG] |= ((AppBIACfg.DftNum << BITP_AFE_DFTCON_DFTNUM ) & (BITM_AFE_DFTCON_DFTNUM) );
    bia_user_applied_dft_num = 0;
  }
  else {
    AppBIACfg.DftNum = (uint32_t) ( g_current_dcfg_bia[BIA_DFT_CONFIG] & BITM_AFE_DFTCON_DFTNUM);
    AppBIACfg.DftNum >>= BITP_AFE_DFTCON_DFTNUM; 
  }
  
  AppBIACfg.FifoThresh = (uint32_t)(g_current_dcfg_bia[BIA_FIFO_THRESHOLD_CONFIG] &  BITM_AFE_DATAFIFOTHRES_HIGHTHRES);
  AppBIACfg.FifoThresh >>= BITP_AFE_DATAFIFOTHRES_HIGHTHRES;
}

/**
      @brief    Load bia default dcfg configuration to working array
      @param    Pointer to configuration array
      @retval   None
*/
void load_bia_default_dcfg_config(uint64_t *cfg) {
    uint16_t i = 0, j = 0,array_ind=0;

    if (cfg == 0) {
        return;
    }
    for (i = 0; i < MAX_DCFG_COMBINED_BIA; i++) {
      while (1) {
        g_current_dcfg_bia[j] = default_dcfg_bia[j]; 
         /* Demarker between DCFG's used to differentiate different register module settings */
        if (cfg[j++] == 0xFFFFFFFFFFFFFFFF) {
          break;
        }
      }
    }
    if((bia_user_applied_dcfg == 0x01))
    {
      for(i=0;i < g_bia_num_ind_settings;i++){
        uint8_t dcfg_position = g_user_bia_indexes[i];
        if(dcfg_position < BIA_MAX_USER_SEQCFG){
          /* find index to set */
           array_ind = bia_mapuserind(&dcfg_position);
           /* clear lower 32 bits which is field */
           g_current_dcfg_bia[array_ind] &= 0xFFFFFFFF00000000;
           /* lower 32 bits to set data bits */
           g_current_dcfg_bia[array_ind] |= g_user_bia_config_dcfg[dcfg_position];
         }
       }
         /* clearing dcfg flag for next use */
        bia_user_applied_dcfg = 0;
    }
    bia_load_lcfg_params();

}

/**
* @brief    Write a bia_init_1_dcfg to ad5940
* @param    p_dcfg - pointer to Dcfg array
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_init_1_dcfg(uint64_t *p_dcfg) {
  uint32_t reg_addr;
  uint32_t reg_data;

  if (p_dcfg == NULL) {
    return BIA_DCFG_STATUS_NULL_PTR;
  }
 
  for (int i = 0;p_dcfg[i]!= 0xFFFFFFFFFFFFFFFF; i++) {

    reg_addr = (uint32_t) (p_dcfg[i] >> 32);
    reg_data = (uint32_t)(p_dcfg[i]);

    AD5940_WriteReg(reg_addr, reg_data);
  }
  return BIA_DCFG_STATUS_OK;
}

/**
* @brief    Write Bia Default Init_1 configuration
* @param    void
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_init_1()
{
  if (write_bia_init_1_dcfg(&g_current_dcfg_bia[0]) != BIA_DCFG_STATUS_OK) {
      return BIA_DCFG_STATUS_ERR;
  }
}

/**
* @brief    Write a bia_init_2_dcfg to ad5940
* @param    p_dcfg - pointer to Dcfg array
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_init_2_dcfg(uint64_t *p_dcfg) {
  uint32_t reg_addr;
  uint32_t reg_data;

  if (p_dcfg == NULL) {
    return BIA_DCFG_STATUS_NULL_PTR;
  }
 
  for (int i = 0;p_dcfg[i]!= 0xFFFFFFFFFFFFFFFF; i++) {

    reg_addr = (uint32_t) (p_dcfg[i] >> 32);
    reg_data = (uint32_t)(p_dcfg[i]);

    AD5940_WriteReg(reg_addr, reg_data);
  }
  return BIA_DCFG_STATUS_OK;
}

/**
* @brief    Write Bia Default Init_2 configuration
* @param    void
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_init_2()
{
  uint16_t i = 0;
  while (g_current_dcfg_bia[i++] != 0xFFFFFFFFFFFFFFFF);
  if (write_bia_init_2_dcfg(&g_current_dcfg_bia[i]) != BIA_DCFG_STATUS_OK) {
      return BIA_DCFG_STATUS_ERR;
  }
}


/**
* @brief    Write a sequencercfg bia_dcfg to ad5940
* @param    p_dcfg - pointer to Dcfg array
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_seqcfg_dcfg(uint64_t *p_dcfg) {
  uint32_t reg_addr;
  uint32_t reg_data;

  if (p_dcfg == NULL) {
    return BIA_DCFG_STATUS_NULL_PTR;
  }
 
  for (int i = 0;p_dcfg[i]!= 0xFFFFFFFFFFFFFFFF; i++) {
    reg_addr = (uint32_t) (p_dcfg[i] >> 32);
    reg_data = (uint32_t)(p_dcfg[i]);

    AD5940_WriteReg(reg_addr, reg_data);
  }
  return BIA_DCFG_STATUS_OK;
}

/**
* @brief    Write bia SequencerCfg dcfg  configuration to ad5940
* @param    void
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_seqcfg()
{
  uint16_t i = 0;
  while (g_current_dcfg_bia[i++] != 0xFFFFFFFFFFFFFFFF);
  while (g_current_dcfg_bia[i++] != 0xFFFFFFFFFFFFFFFF);
  if (write_bia_seqcfg_dcfg(&g_current_dcfg_bia[i]) != BIA_DCFG_STATUS_OK) {
      return BIA_DCFG_STATUS_ERR;
  }

