ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
}

/**
* @brief    Write a bia sequencer measurement dcfg to ad5940
* @param    p_dcfg - pointer to Dcfg array
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_seqmeasurement_dcfg(uint64_t *p_dcfg) {
  uint32_t reg_addr;
  uint32_t reg_data;

  if (p_dcfg == NULL) {
    return BIA_DCFG_STATUS_NULL_PTR;
  }
 
  for (int i = 0;p_dcfg[i]!= 0xFFFFFFFFFFFFFFFF; i++) {
    if((uint32_t) (p_dcfg[i] >> 32) == 0xEEEEEEEE){

      AD5940_SEQGenInsert((uint32_t)(p_dcfg[i]));

    }
    else {

      reg_addr = (uint32_t) (p_dcfg[i] >> 32);
      reg_data = (uint32_t)(p_dcfg[i]);
      AD5940_WriteReg(reg_addr, reg_data);

    }
  }
  return BIA_DCFG_STATUS_OK;
}


/**
* @brief    Write bia Sequencer measurement dcfg configuration to ad5940
* @param    void
* @retval   Status
*/
BIA_DCFG_STATUS_t write_bia_seqmeasurement()
{
  uint16_t i = 0;
  while (g_current_dcfg_bia[i++] != 0xFFFFFFFFFFFFFFFF);
  while (g_current_dcfg_bia[i++] != 0xFFFFFFFFFFFFFFFF);
  while (g_current_dcfg_bia[i++] != 0xFFFFFFFFFFFFFFFF);

  if (write_bia_seqmeasurement_dcfg(&g_current_dcfg_bia[i]) != BIA_DCFG_STATUS_OK) {
      return BIA_DCFG_STATUS_ERR;
  }

}

#endif
/*!
  ****************************************************************************
 * @brief  Bcm App Initialization
 * @param  None
 * @return ECG_ERROR_CODE_t: Success/Error
 *****************************************************************************/
BIA_ERROR_CODE_t BiaAppInit() {
  BIA_ERROR_CODE_t retVal = BIA_ERROR;
  /* Ldo power on */
  adp5360_enable_ldo(ECG_LDO,true);


  /* switch off other switches */

/*
#ifdef ENABLE_ECG_APP
  DG2502_SW_control_AD8233(false);
#endif
  DG2502_SW_control_ADPD4000(false);
*/
   /* Initialization of application parameters */
  InitCfg();
   
   /* start bia initialization */
   ad5940_bia_start();
   gBiaAppInitFlag = true;
  /* Control BIA measurment to start. Second parameter has no meaning with this command. */
  AppBIACtrl(APPCTRL_START, 0);
  NRF_LOG_INFO("Bia ODR=%d",AppBIACfg.BiaODR);
  retVal = BIA_SUCCESS;

  return retVal;

}

/*!
  ****************************************************************************
 * @brief  Bia App de Initialization
 * @param  None
 * @return BIA_ERROR_CODE_t: Success/Error
 *****************************************************************************/
BIA_ERROR_CODE_t BiaAppDeInit() {
  /* BIA stop sync */
  if(AppBIACtrl(APPCTRL_STOPSYNC, 0)!=0){
    return BIA_ERROR;
  }
  /* Interrupts de init */
  ad5940_port_deInit();
  gBiaAppInitFlag = false;
#ifdef BIA_DCFG_ENABLE
  /*resetting default load flag*/
  bia_load_dcfg = 1;
#endif//BIA_DCFG_ENABLE
  /* de init ldo power */
  adp5360_enable_ldo(ECG_LDO,false);
  return BIA_SUCCESS;
}

/*!
  ****************************************************************************
 * @brief   convert_uint32_to_float
 * @param   Hex value
 * @return  float value
 *****************************************************************************/
float convert_uint32_to_float (uint32_t num)
{
    //// num comes in as 32 bits or 8 byte  
    float original_num = num;
    uint32_t  sign = num >>31;
    int32_t  exponent = ((num >> 23) & 0xff) - 0x7F;
    uint32_t  mantissa = num << 9;
    float  value = 0;
    float mantissa2;

    NRF_LOG_INFO("input is : %d", num);

    value = 0.5f;
    mantissa2 = 0.0f;
    while (mantissa)
    {
        if (mantissa & 0x80000000)
            mantissa2 += value;
        mantissa <<= 1;
        value *= 0.5f;
    }

      NRF_LOG_INFO("Sign:%d,exponent:%d, mantissa2:%f", sign,exponent,mantissa2);

      /* value = sign * (1.0f + mantissa2) * (pow (2, exponent)); */
      value = (1.0f + mantissa2) * (pow (2, exponent));
     if (sign) value = -value;
    NRF_LOG_INFO("Float value:%f", value);
    return value;
}

/*!
  ****************************************************************************
  * @brief    Example of how to write an LCFG parameter
  * @param    field: LCFG field that has to be written
  * @param    value: Value to be written
  * @retval   BIA_ERROR_CODE_t
 *****************************************************************************/
BIA_ERROR_CODE_t BiaWriteLCFG(uint8_t field, float value) {
  AppBIACfg_Type *pCfg;
  AppBIAGetCfg(&pCfg);
  if(field < BIA_LCFG_MAX){
    switch(field){
    case BIA_LCFG_FS: /* field 0 */
      pCfg->BiaODR = value;
      bia_user_applied_odr = 1;
      break;
    case BIA_LCFG_ADC_PGA_GAIN: /* field 1 */
      pCfg->ADCPgaGain = value;
      user_applied_pga_gain = 1;
      break;
    case BIA_LCFG_PWR_MOD:/* field 2 */
      pCfg->PwrMod = value;
      user_applied_bia_pwr_mod = 1;
      break;
   case BIA_LCFG_SIN_FREQ: /* field 3 */
      pCfg->SinFreq= value;
      user_applied_sin_freq = 1;
      break;
   case BIA_DFT_NUM: /* field 4 */
      pCfg->DftNum= value;
      bia_user_applied_dft_num = 1;
      break;
#ifdef BCM_ALGO
   case BCM_FFM_DATA_RATE: /* field 5 */
     // g_state_bia.algo_decimation_factor = value;
      bcm_config_handle.output_data_rate = value;
      user_applied_algo_decimation_factor = 1;
      break;
   case BCM_ALGO_ENABLE:/* field 6 */
      lcfg_bcm_algo_en = value;
     break;
    case BCM_ALGO_HEIGHT:/* field 7 */
      bcm_config_handle.adi_vsm_bcm_algo_config.height = value;
      break;
    case BCM_ALGO_WEIGHT:/* field 8 */
      bcm_config_handle.adi_vsm_bcm_algo_config.weight = value;
     break;
    case BCM_ALGO_AGE: /* field 9 */
      bcm_config_handle.adi_vsm_bcm_algo_config.age = value;
     break;
    case BCM_ALGO_COEFF_CONFIG_ZERO: /* field 10 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[0] = value;
      break;
    case BCM_ALGO_COEFF_CONFIG_ONE: /* field 11 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[1] = value;
      break;
    case BCM_ALGO_COEFF_CONFIG_TWO: /* field 12 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[2] = value;
      break;
    case BCM_ALGO_COEFF_CONFIG_THREE: /* field 13 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[3] = value;
      break;
     case BCM_ALGO_COEFF_CONFIG_FOUR: /* field 14 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[4] = value;
      break;
     case BCM_ALGO_COEFF_CONFIG_FIVE: /* field 15 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[5] = value;
      break;
     case BCM_ALGO_COEFF_CONFIG_SIX: /* field 16 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[6] = value;
      break;
     case BCM_ALGO_COEFF_CONFIG_SEVEN: /* field 17 */
      bcm_config_handle.adi_vsm_bcm_algo_config.b[7] = value;
      break;
#endif
  }
#ifdef BCM_ALGO
    /* if bcm algo en, bia running, update config */
     if(g_state_bia.num_starts == 1){
      if(lcfg_bcm_algo_en){
        /* update configuration */
        adi_vsm_bcm_update_config(bcm_instance,&bcm_config_handle);
      }
     }
#endif
    return BIA_SUCCESS;
  }
  return BIA_ERROR;
}

/*!
  ****************************************************************************
  * @brief    Read LCFG parameter
  * @param    index: LCFG field
  * @param    value: Returned corresponding LCFG value
  * @retval   BIA_ERROR_CODE_t
 *****************************************************************************/
BIA_ERROR_CODE_t BiaReadLCFG(uint8_t index, float *value) {
AppBIACfg_Type *pCfg;
AppBIAGetCfg(&pCfg);
if(index < BIA_LCFG_MAX){
    switch(index){
    case BIA_LCFG_FS: /* field 0 */
      *value = (uint64_t)(pCfg->BiaODR);
      break;
    case BIA_LCFG_ADC_PGA_GAIN: /* field 1 */
      *value = pCfg->ADCPgaGain;
      break;
    case BIA_LCFG_PWR_MOD: /* field 2 */
      *value = pCfg->PwrMod;
      break;
    case BIA_LCFG_SIN_FREQ: /* field 3 */
      *value =  (uint64_t)(pCfg->SinFreq);
      break;
    case BIA_DFT_NUM: /* field 4 */
      *value = pCfg->DftNum;
      break;
#ifdef BCM_ALGO
    case BCM_FFM_DATA_RATE: /* field 5 */
      //*value = g_state_bia.algo_decimation_factor;
      *value = bcm_config_handle.output_data_rate;
      break;
   case BCM_ALGO_ENABLE:/* field 6 */
      *value = lcfg_bcm_algo_en;
      break;
    case BCM_ALGO_HEIGHT:/* field 7 */
     *value = bcm_config_handle.adi_vsm_bcm_algo_config.height;
     break;
    case BCM_ALGO_WEIGHT:/* field 8 */
      *value = bcm_config_handle.adi_vsm_bcm_algo_config.weight;
      break;
    case BCM_ALGO_AGE: /* field 9 */
      *value = bcm_config_handle.adi_vsm_bcm_algo_config.age;
      break;
    case BCM_ALGO_COEFF_CONFIG_ZERO: /* field 10 */
      *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[0];
      break;
    case BCM_ALGO_COEFF_CONFIG_ONE: /* field 11 */
      *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[1];
      break;
    case BCM_ALGO_COEFF_CONFIG_TWO: /* field 12 */
     *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[2];
      break;
    case BCM_ALGO_COEFF_CONFIG_THREE: /* field 13 */
     *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[3];
      break;
     case BCM_ALGO_COEFF_CONFIG_FOUR: /* field 14 */
      *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[4];
      break;
     case BCM_ALGO_COEFF_CONFIG_FIVE: /* field 15 */
     *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[5];
      break;
     case BCM_ALGO_COEFF_CONFIG_SIX: /* field 16 */
     *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[6];
      break;
     case BCM_ALGO_COEFF_CONFIG_SEVEN: /* field 17 */
     *value = bcm_config_handle.adi_vsm_bcm_algo_config.b[7];
      break;
#endif
   }
    return BIA_SUCCESS;
  }
  return BIA_ERROR;
}

/*!
  ****************************************************************************
  *@brief      Get Bcm application structure
  *@param      pCfg: void pointer
  *@return     AD5940ERR_OK/AD5940ERR_PARA
******************************************************************************/
AD5940Err AppBIAGetCfg(void *pCfg) {
  if(pCfg) {
    *(AppBIACfg_Type**)pCfg = &AppBIACfg;
    return AD5940ERR_OK;
  }
  return AD5940ERR_PARA;
}


/*!
  ****************************************************************************
  *@brief      Convert into Cartesian form
  *@param      Pointer to float real/imaginary
  *@return     SUCCESS
******************************************************************************* */
void ConvertToCartesianForm(fImpCar_Type *pData){
  fImpCar_Type pRes;
  pRes.Real = (pData->Real)*cos(pData->Image);
  pRes.Image = (pData->Real)*sin(pData->Image);
  NRF_LOG_INFO("%d,%d",pRes.Real,pRes.Image);
  pData->Real = pRes.Real;
  pData->Image = pRes.Image;
}


#ifdef DEBUG_DCB
extern uint16_t MemNumBlks;
extern uint16_t MemFreeBlks;

/*!
  ****************************************************************************
  *@brief      Function for getting status of fds records
  *@param      Pointer to m2m2_hdr_t
  *@return     structure m2m2_hdr_t
******************************************************************************* */
static m2m2_hdr_t *adi_dcb_fds_stat(m2m2_hdr_t *p_pkt) {
    fds_stat_t stat = {0};
    /* Allocate memory for response packet payload */
    PKT_MALLOC(p_resp_pkt, m2m2_dcb_fds_status_info_resp_t, 0);
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_fds_status_info_resp_t, p_resp_payload);
    /* Read FDS status */
    get_fds_status(&stat);
    p_resp_payload->command = M2M2_DCB_COMMAND_FDS_STATUS_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->dirty_records = stat.dirty_records;
    p_resp_payload->open_records = stat.open_records;
    p_resp_payload->valid_records = stat.valid_records;
    p_resp_payload->pages_available = stat.pages_available;
    p_resp_payload->num_blocks = MemNumBlks;
    p_resp_payload->blocks_free = MemFreeBlks;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    return p_resp_pkt;
}
#endif

///////////////////////////////////////////////////////////////////
#ifdef DCB
/*!
 ****************************************************************************
 * @brief    Gets the entire bcm DCB configuration written in flash
 * @param    bia_dcb_data: pointer to dcb struct variable,
 *            in size of data in Double Word (32-bits)
 * @param    read_size: The size of the record to be returned to the user
 * @retval   BIA_ERROR_CODE_t: Status
 *****************************************************************************/
BIA_ERROR_CODE_t read_bia_dcb(uint32_t *bia_dcb_data, uint16_t *read_size) {
  BIA_ERROR_CODE_t dcb_status = BIA_ERROR;

