ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
  if (adi_dcb_read_from_fds(ADI_DCB_BIA_BLOCK_IDX, bia_dcb_data, read_size) == DEF_OK) {
    dcb_status = BIA_SUCCESS;
  }
  return dcb_status;
}

/*!
 ****************************************************************************
 * @brief    Sets the entire bcm DCB configuration in flash
 * @param    bia_dcb_data: pointer to dcb struct variable,
 *            in size of data in Double Word (32-bits)
 * @param    write_Size: The size of the record to be written
 * @retval   BIA_ERROR_CODE_t: Status
 *****************************************************************************/
BIA_ERROR_CODE_t write_bia_dcb(uint32_t *bia_dcb_data, uint16_t write_Size) {
  BIA_ERROR_CODE_t dcb_status = BIA_ERROR;

  if (adi_dcb_write_to_fds(ADI_DCB_BIA_BLOCK_IDX, bia_dcb_data, write_Size) == DEF_OK) {
    dcb_status = BIA_SUCCESS;
  }
  return dcb_status;
}

/*!
 ****************************************************************************
 * @brief    Delete the entire bcm DCB configuration in flash
 * @param    None
 * @retval   BIA_ERROR_CODE_t: Status
 *****************************************************************************/
BIA_ERROR_CODE_t delete_bia_dcb(void) {
  BIA_ERROR_CODE_t dcb_status = BIA_ERROR;

  if (adi_dcb_delete_fds_settings(ADI_DCB_BIA_BLOCK_IDX) == DEF_OK) {
    dcb_status = BIA_SUCCESS;
  }
  return dcb_status;
}

/*!
 ****************************************************************************
 * @brief    Set the dcb present flag
 * @param    set_flag: flag to set presence of dcb in flash
 * @retval   None
 *****************************************************************************/
void bcm_set_dcb_present_flag(bool set_flag) {
  g_bia_dcb_Present = set_flag;
  NRF_LOG_INFO("BCM DCB present set: %s",
      (g_bia_dcb_Present == true ? "TRUE" : "FALSE"));
}

/*!
 ****************************************************************************
 * @brief    Get whether the dcb is present in flash
 * @param    None
 * @retval   bool: TRUE: dcb present, FALSE: dcb absent
 *****************************************************************************/
bool bia_get_dcb_present_flag(void) {
  NRF_LOG_INFO(
      "BCM DCB present: %s", (g_bia_dcb_Present == true ? "TRUE" : "FALSE"));
  return g_bia_dcb_Present;
}

/*!
 ****************************************************************************
 * @brief    Update the global dcb presence flag in flash
 * @param    None
 * @retval   None
 *****************************************************************************/
void bia_update_dcb_present_flag(void) {
  g_bia_dcb_Present = adi_dcb_check_fds_entry(ADI_DCB_BIA_BLOCK_IDX);
  NRF_LOG_INFO("Updated. BCM DCB present: %s",
      (g_bia_dcb_Present == true ? "TRUE" : "FALSE"));
}


/*!
 ****************************************************************************
 * @brief    Update the lcfg from dcb
 * @param    p_pkt: pointer to packet
 * @retval   m2m2_hdr_t
 *****************************************************************************/
static m2m2_hdr_t *bia_app_set_dcb_lcfg(m2m2_hdr_t *p_pkt) {
  uint32_t bia_dcb[MAXBIADCBSIZE] = {'\0'};
  float f_value;
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PKT_MALLOC(p_resp_pkt, bia_app_dcb_lcfg_t, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, bia_app_dcb_lcfg_t, p_resp_payload);
    if (bia_get_dcb_present_flag() == true) {
      uint16_t size = MAXBIADCBSIZE;
      if (read_bia_dcb(&bia_dcb[0], &size) == BIA_SUCCESS) {
        for (uint16_t i = 0; i < size; i++) {
          /*
          each bia_dcb array element stores value in total 4
          bytes. for ex- ifvbia_dcb[i] = 0x00ABCDEF 
          Value = 0xCDEF 
          */
          /* field is iteration count */
          uint16_t field = i;

          /* copy value and convert into hex */
          if( i < MAX_DECIMAL_ENTRIES ){
            f_value = (float)bia_dcb[i];
          }
          else  {
            f_value = convert_uint32_to_float(bia_dcb[i]);
          }
          if (BiaWriteLCFG(field, f_value) == BIA_SUCCESS) {
            status = M2M2_APP_COMMON_STATUS_OK;
          } else {
            status = M2M2_APP_COMMON_STATUS_ERROR;
          }
        }
      } else {
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    } else {
      /* Since this function is for setting dcb lcfg for bcm,
        and because this is the case when dcb lcfg is not present,
        therefore error status given */
      status = M2M2_APP_COMMON_STATUS_ERROR;
    }
    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_APP_COMMON_CMD_SET_LCFG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief    Read the dcb configuration
 * @param    p_pkt: pointer to packet
 * @retval   m2m2_hdr_t
 *****************************************************************************/
static m2m2_hdr_t *bia_dcb_command_read_config(m2m2_hdr_t *p_pkt) {
  uint32_t dcbdata[MAXBIADCBSIZE];
  static uint16_t r_size = 0;
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  // Declare a pointer to access the input packet payload
  // PYLD_CST(p_pkt, m2m2_dcb_bcm_data_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_bia_data_t, 0);
  if (NULL != p_resp_pkt) {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_bia_data_t, p_resp_payload);

    r_size = MAXBIADCBSIZE;
    if (read_bia_dcb(&dcbdata[0], &r_size) == BIA_SUCCESS) {
      for (uint16_t i = 0; i < r_size; i++)  {
        p_resp_payload->dcbdata[i] = dcbdata[i];
        p_resp_payload->size = (r_size);
        status = M2M2_DCB_STATUS_OK;
      }
   }else {
      p_resp_payload->size = 0;
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

