ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad5940_bia/bia_application_task.c
static m2m2_hdr_t *bia_dcb_command_write_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
  uint32_t dcbdata[MAXBIADCBSIZE];
  
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_dcb_bia_data_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_bia_data_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_bia_data_t, p_resp_payload);
    for (int i = 0; i < p_in_payload->size; i++)  {
      dcbdata[i] = p_in_payload->dcbdata[i];
     }
      if (write_bia_dcb(&dcbdata[0], p_in_payload->size) == BIA_SUCCESS) {
        bcm_set_dcb_present_flag(true);
        status = M2M2_DCB_STATUS_OK;
      } else {
        status = M2M2_DCB_STATUS_ERR_ARGS;
      }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i< MAXBIADCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

static m2m2_hdr_t *bia_dcb_command_delete_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_bia_data_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_bia_data_t, p_resp_payload);

    if (delete_bia_dcb() == BIA_SUCCESS) {
      bcm_set_dcb_present_flag(false);
      status = M2M2_DCB_STATUS_OK;
    } else {
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i< MAXBIADCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
* @brief            Get Frequency index of excitation signal frequecny
*                   during the BIA packetization
*
* @param[in]        float frequency: excitation frequecny using for BIA measurement
*
* @return           Enum M2M2_SENSOR_BIA_SWEEP_FREQ_INDEX_ENUM_t   
*                    M2M2_SENSOR_BIA_FREQ_1000HZ = 0,
*                    M2M2_SENSOR_BIA_FREQ_3760HZ = 1,
*                    M2M2_SENSOR_BIA_FREQ_14140HZ = 2,
*                    M2M2_SENSOR_BIA_FREQ_53180HZ = 3,
*                    M2M2_SENSOR_BIA_FREQ_200KHZ = 4,
*                    M2M2_SENSOR_BIA_FREQ_50KHZ = 255,
*/
static M2M2_SENSOR_BIA_SWEEP_FREQ_INDEX_ENUM_t GetBIASweepFrequencyIndex(float frequency)  {
  /* TODO compare sweep frquency and rerurn index based on that
     currently assuming default frequecny is 50KHz always*/
  //if(frequecny == 50000){
   return M2M2_SENSOR_BIA_FREQ_50KHZ;
}

#ifdef BCM_ALGO
/*
---------------------------------------BCM Configurations -------------------------------------------------------
*/
#define STATE_MEM_PER_INSTANCE          100 //state memory size=71

#define NUM_INSTANCE                    1
#define STATE_BCM_MEM_NUM_CHARS         (NUM_INSTANCE * STATE_MEM_PER_INSTANCE)

/* Allocate a max amount of memory for the SQI Algo state memory block */
uint8_t STATE_memory_BCM[STATE_BCM_MEM_NUM_CHARS];

adi_vsm_bcm_mem_t bcm_memory_setup;

/**
* @brief       Configure BCM Algorithm Generic parameters
*
* @param[in]   input_sample_freq    sampling frequency of BCM signal
*              ODR                  Output data rate of BCM signal
* @param[in]   bcm_config_handle        pointer to struct. holding the config
*
* @return      BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t BcmAlgGenericConfig(uint8_t input_sample_freq,
                                          uint8_t odr,
                                          adi_vsm_bcm_config_t* bcm_config_handle)  {
    NULL_POINTER_CHECK(bcm_config_handle);
    if (input_sample_freq < 1 || input_sample_freq > 100)
    {
        return BCM_ALG_ERROR;
    }
    /* Decimation not possible */
    if(odr > input_sample_freq)
    {
      return BCM_ALG_ERROR;
    }
    bcm_config_handle->sampling_freq = input_sample_freq;
    return BCM_ALG_SUCCESS;
}

/**
* @brief       Configure BCM Algorithm Body parameters
*
* @param[in]   height               Height of person
*              weight               Weight of person
*              age                  Age of person
* @param[in]   bcm_config_handle        pointer to struct. holding the config
*
* @return      BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t BcmAlgBodyParametersConfig(uint8_t height,
                                                uint8_t weight,
                                                uint8_t age,
                                                adi_vsm_bcm_config_t* bcm_config_handle)  {
    NULL_POINTER_CHECK(bcm_config_handle);
    bcm_config_handle->adi_vsm_bcm_algo_config.age = age;
    bcm_config_handle->adi_vsm_bcm_algo_config.height = age;
    bcm_config_handle->adi_vsm_bcm_algo_config.weight = age;

    return BCM_ALG_SUCCESS;
}

/**
* @brief       Configure BCM Algorithm Coefficients
*
* @param[in]   coeff                Pointer to an array of coefficients
* @param[in]   bcm_config_handle        pointer to struct. holding the config
*
* @return       BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t BcmAlgCoeffConfig(float coeff[],
                                       adi_vsm_bcm_config_t* bcm_config_handle)  {
    NULL_POINTER_CHECK(bcm_config_handle);
    memcpy(bcm_config_handle->adi_vsm_bcm_algo_config.b,coeff,(sizeof(float)*ALLOWED_POLY_COEFFICIENTS));

    return BCM_ALG_SUCCESS;
}

/**
* @brief        BCM Algorithm Init, Creates BCM Instance
*
* @param[in]    bcm_config_handle        pointer to struct. holding the config
* @param[out]   instance             double pointer to BCM instance to be created
*
* @return       BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t BcmAlgInit(const adi_vsm_bcm_config_t* bcm_config_handle,
                                  adi_vsm_bcm_instance_t** instance)  {
    NULL_POINTER_CHECK(bcm_config_handle);
    NULL_POINTER_CHECK(instance);

    /* initialize the memory object for the BCM instance */
    bcm_memory_setup.state.block = STATE_memory_BCM;
    bcm_memory_setup.state.length_numchars = STATE_MEM_PER_INSTANCE;

    /* Create the BCM Measurement instance */
    *instance = adi_vsm_bcm_create(&bcm_memory_setup, bcm_config_handle);
    if (*instance == NULL) {
        return BCM_ALG_ERROR;
    }
    return BCM_ALG_SUCCESS;
}


/**
* @brief        Do BCM Instance reset
*
* @param[in]    instance            pointer to BCM instance
*
* @return       BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t BcmAlgReset(adi_vsm_bcm_instance_t* instance) {
    NULL_POINTER_CHECK(instance);
    adi_vsm_bcm_return_code_t ret_code = ADI_VSM_BCM_ERROR;

    ret_code = adi_vsm_bcm_algo_reset(instance);
    RETURN_CODE(ret_code);
}


/**
* @brief        Do BCM Algorithm process
*
* @param[in]    instance                pointer to BCM instance
* @param[in]    resistive_sample        resistive sample to be processed
* @param[in]    reactive_sample         reactive sample to be processed
* @param[out]   adi_vsm_bcm_output      pointer to struct containing BCM output
*
* @return       BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t BcmAlgProcess(adi_vsm_bcm_instance_t * instance,
                                    float *bodyImpedance,
                                    adi_vsm_bcm_output_t * adi_vsm_bcm_output)  {
    NULL_POINTER_CHECK(instance);
    NULL_POINTER_CHECK(adi_vsm_bcm_output);
    adi_vsm_bcm_return_code_t ret_code = ADI_VSM_BCM_ERROR;
    ret_code = adi_vsm_bcm_process(instance,bodyImpedance,
                                    adi_vsm_bcm_output);
    RETURN_CODE(ret_code);
}

/**
* @brief        Do BCM Algo init
*
* @param[in]    NONE
*
* @return       BCM_ALG_RETURN_CODE_t
*/
BCM_ALG_RETURN_CODE_t bcm_algo_init() {
  BCM_ALG_RETURN_CODE_t ret_code;
  ret_code = BcmAlgInit(&bcm_config_handle,&bcm_instance);
  return ret_code;
}

/**
* @brief            Check for BIA data stability
*
* @param[in]        float body_impedance_real     : impedance Real value
* @param[in]        float body_impedance_imaginary: impedance Imaginary value
*
* @return           0-bia data not stable, 1-bia data stable
*/
uint8_t check_bia_data_stability(float body_impedance_real,float body_impedance_imaginary)  {
  uint8_t nElectrodeStatus = 0;
  float Ohmsdiff = 0;

  if (((body_impedance_real > 100) && (body_impedance_real < 5000)) && ((body_impedance_imaginary > -500) && (body_impedance_imaginary < 100)))
  {
    nElectrodeStatus = 1; /* set the electrode status = 1 // touched */
  }
  else
  {
    nElectrodeStatus = 0;
  }

  if (nElectrodeStatus == 1)
  {
    gbia_data_buffer[gbia_data_count++] = body_impedance_real;
    if(gbia_data_count == BIA_DATA_BUFFER_SIZE) { 
      gbia_data_count = 0;
      Ohmsdiff = gbia_data_buffer[0] - gbia_data_buffer[BIA_DATA_BUFFER_SIZE -1];
      memset(gbia_data_buffer,0,sizeof(gbia_data_buffer));
      if (Ohmsdiff < BIA_STABILITY_OHMS_DIFF) //Checking ohms difference
      {
        if (++gbia_stability_samplecount >= BIA_STABILITY_SAMPLES_COUNT) //counting samples
        {
            gnBiaDataStable = 1; // set signal stability
            gbia_stability_samplecount = 0;
        }
      }else {
        gbia_stability_samplecount = 0;
        gnBiaDataStable = 0;
      }
    }
  }else{
    Init_bia_data_stability();
  }

  return gnBiaDataStable;
}

/**
* @brief            Init for BIA data stability check
*
* @param[in]        None
*
* @return           None
*/
void Init_bia_data_stability()  {
  memset(gbia_data_buffer,0,sizeof(gbia_data_buffer));
  gbia_data_count = 0;
  gbia_stability_samplecount = 0;
  gnBiaDataStable = 0;
}


#endif
#endif
#endif

